notes/resources/rust/rust.org
#+TITLE: Rust
#+DATE: [2021-10-28 Thu 20:00]
#+AUTHOR: Damian Chrzanowski
#+EMAIL: pjdamian.chrzanowski@gmail.com
#+OPTIONS: TOC:2 num:2
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
#+HTML_HEAD: <link rel="icon" href="../../assets/favicon.ico">
* Links
** [[https://www.rust-lang.org/][Official Page]]
** [[https://doc.rust-lang.org/stable/book/][The Rust Book]]
** [[https://users.rust-lang.org/][Rust Forums]]
** [[https://crates.io/][Cargo Crates]]
** [[https://lib.rs/about][Additional Crates, supposedly a better repository]]
* Setup
** Installation
   - Install ~rustup~, ~rust-analyzer~ and ~sccache~
   #+begin_src shell
     yay -S rustup rust-analyzer
   #+end_src
   - Install a toolchain and set it as default
   #+begin_src shell
     rustup default stable
   #+end_src
   - Update the toolchain (if needed)
   #+begin_src shell
     rustup update
   #+end_src
   - Install a different toolchain, where TOOLCHAIN is one of: stable, beta, nightly or 1.23.0
   #+begin_src shell
     rustup toolchain install TOOLCHAIN
   #+end_src
   - Install a toolchain for a different architecture, get the list of available architectures with:
   #+begin_src shell
     rustup target list
     rustup toolchain install stable-x86_64-pc-windows-gnu
   #+end_src
   - Verify installed version
   #+begin_src shell
     rustc -V
   #+end_src
   - Add ~sccache~ to global rust config in =~/.cargo/config=
   #+begin_src conf
     [build]
     rustc-wrapper = "sccache"
   #+end_src
** Adding Components
   - Add a component
   #+begin_src shell
     rustup component add COMPONENT_NAME
   #+end_src
   - Add the formatter and the language server
   #+begin_src shell
     rustup component add rustfmt
     rustup component add rls
   #+end_src
* Project Management
  - Creating a new project
   #+begin_src shell
     cargo new PROJECT_NAME
   #+end_src
  - Check for errors
   #+begin_src shell
     cargo check
   #+end_src
  - Building a project
   #+begin_src shell
     cargo build
   #+end_src
  - Building a project for release
   #+begin_src shell
     cargo build --release
   #+end_src
  - Running a project
   #+begin_src shell
     cargo run
   #+end_src
  - Updating dependencies
   #+begin_src shell
     cargo update
   #+end_src
  - Build current dependencies' documentation and open in a browser
   #+begin_src shell
     cargo doc --open
   #+end_src
* Basics
** Starting point ~main~ function
   #+begin_src rust
     fn main() {
         //
     }
   #+end_src
** Printing output
   #+begin_src rust
     use std::io;
     // in main...
     let x = 5;
     let y = 10;
     println!("Hello world"); // it's a macro for printing to stdout
     println!("Var x = {x}"); // string interpolation
     println!("Hello world var x = {}, var y = {}", x, y); // string interpolation
   #+end_src
