notes/resources/rust/rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-29 Tue 18:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rust</title>
<meta name="author" content="Damian Chrzanowski" />
<meta name="generator" content="Org Mode" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rust</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org514a680">1. Links</a>
<ul>
<li><a href="#org32a38aa">1.1. Official Page</a></li>
<li><a href="#orgf2b12c8">1.2. The Rust Book</a></li>
<li><a href="#org10ca911">1.3. Rust Forums</a></li>
<li><a href="#orga04f81d">1.4. Cargo Crates</a></li>
<li><a href="#org04c22f4">1.5. Additional Crates, supposedly a better repository</a></li>
</ul>
</li>
<li><a href="#orgb4bf414">2. Setup</a>
<ul>
<li><a href="#orgf1dff01">2.1. Installation</a></li>
<li><a href="#org9473990">2.2. Adding Components</a></li>
</ul>
</li>
<li><a href="#orge492285">3. Project Management</a></li>
<li><a href="#orge6ef7f7">4. Basics</a>
<ul>
<li><a href="#org4080887">4.1. Starting point <code>main</code> function</a></li>
<li><a href="#org867f084">4.2. Printing output</a></li>
<li><a href="#org5cb8c94">4.3. Declaring variables</a></li>
<li><a href="#orgfd42771">4.4. Declaring constants</a></li>
<li><a href="#org5dcaef2">4.5. Getting a String input from <code>stdin</code></a></li>
</ul>
</li>
<li><a href="#org3a1431b">5. Statements and Expressions</a></li>
<li><a href="#org3ba9b67">6. Variable shadowing</a></li>
<li><a href="#orgd08576f">7. Error Handling and the <code>Result enum</code></a>
<ul>
<li><a href="#orgdf3cd17">7.1. Basic error handling with <code>expect</code></a></li>
<li><a href="#orgb4b4b4d">7.2. Error handling with <code>match</code></a></li>
</ul>
</li>
<li><a href="#org630d6d7">8. Comparing Values with <code>Ordering</code> and <code>match</code></a>
<ul>
<li><a href="#orgc16cf6b">8.1. We can compare values with the <code>Ordering</code> enum</a></li>
<li><a href="#org73f8869">8.2. Sample code</a></li>
</ul>
</li>
<li><a href="#org2e4057d">9. Random number generation</a>
<ul>
<li><a href="#org03f48b1">9.1. Add <code>rand</code> to the <code>cargo.toml</code> file</a></li>
<li><a href="#orgee6e3aa">9.2. Using rand</a></li>
</ul>
</li>
<li><a href="#org93e143f">10. Type Casting</a>
<ul>
<li><a href="#orgdc6f0e0">10.1. Strings</a></li>
</ul>
</li>
<li><a href="#org1f61458">11. Data Types</a>
<ul>
<li><a href="#org32d9ef0">11.1. Scalar, four primitive types</a></li>
<li><a href="#orgdad60f1">11.2. Compound</a></li>
</ul>
</li>
<li><a href="#org5c4581f">12. Functions</a>
<ul>
<li><a href="#orge551f13">12.1. Declaring a function</a></li>
<li><a href="#org6c3caf3">12.2. Examples</a></li>
</ul>
</li>
<li><a href="#orgf134a75">13. Control Flow</a>
<ul>
<li><a href="#orgb5a6d39">13.1. <code>if</code> Statements</a></li>
<li><a href="#orge0260ab">13.2. Infinite <code>loop</code></a></li>
<li><a href="#org9c5a2a6">13.3. Conditional <code>while</code> loop</a></li>
<li><a href="#orgdd57f65">13.4. Looping through Collections with <code>for</code></a></li>
</ul>
</li>
<li><a href="#orgbb41c92">14. Ownership</a>
<ul>
<li><a href="#orgbc3f7ad">14.1. Rules</a></li>
<li><a href="#org5477472">14.2. Basic example of Ownership</a></li>
<li><a href="#orge00273a">14.3. Transferring Ownership</a></li>
<li><a href="#org91434c5">14.4. Borrowing</a></li>
</ul>
</li>
<li><a href="#org96bd6bc">15. Slice Type</a>
<ul>
<li><a href="#org8e50569">15.1. Definition</a></li>
<li><a href="#org1c4cf62">15.2. Caveats</a></li>
<li><a href="#org30493f8">15.3. Declaring a Slice using Rust's Range syntax</a></li>
<li><a href="#orgc385f7e">15.4. Example on a String Slice</a></li>
<li><a href="#org8e7b5f9">15.5. Example of a problem noticed by the compiler thanks to Slices usage</a></li>
</ul>
</li>
<li><a href="#orgb1868f1">16. Structs</a>
<ul>
<li><a href="#orgf368e41">16.1. Syntax</a></li>
<li><a href="#org11dbf89">16.2. Builders</a></li>
<li><a href="#orge552caf">16.3. Instantiate an instance from another instance using a shorthand</a></li>
<li><a href="#orgae0b8f0">16.4. Tuple Structs without named fields</a></li>
<li><a href="#org4859de6">16.5. Unit-like Struct without fields</a></li>
<li><a href="#orgf3b4d6d">16.6. Method Syntax</a></li>
</ul>
</li>
<li><a href="#orgbeba9b9">17. Delete heading at the end</a></li>
</ul>
</div>
</div>
<div id="outline-container-org514a680" class="outline-2">
<h2 id="org514a680"><span class="section-number-2">1.</span> Links</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org32a38aa" class="outline-3">
<h3 id="org32a38aa"><span class="section-number-3">1.1.</span> <a href="https://www.rust-lang.org/">Official Page</a></h3>
</div>
<div id="outline-container-orgf2b12c8" class="outline-3">
<h3 id="orgf2b12c8"><span class="section-number-3">1.2.</span> <a href="https://doc.rust-lang.org/stable/book/">The Rust Book</a></h3>
</div>
<div id="outline-container-org10ca911" class="outline-3">
<h3 id="org10ca911"><span class="section-number-3">1.3.</span> <a href="https://users.rust-lang.org/">Rust Forums</a></h3>
</div>
<div id="outline-container-orga04f81d" class="outline-3">
<h3 id="orga04f81d"><span class="section-number-3">1.4.</span> <a href="https://crates.io/">Cargo Crates</a></h3>
</div>
<div id="outline-container-org04c22f4" class="outline-3">
<h3 id="org04c22f4"><span class="section-number-3">1.5.</span> <a href="https://lib.rs/about">Additional Crates, supposedly a better repository</a></h3>
</div>
</div>
<div id="outline-container-orgb4bf414" class="outline-2">
<h2 id="orgb4bf414"><span class="section-number-2">2.</span> Setup</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf1dff01" class="outline-3">
<h3 id="orgf1dff01"><span class="section-number-3">2.1.</span> Installation</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Install <code>rustup</code>, <code>rust-analyzer</code> and <code>sccache</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">yay</span> <span style="color: #a9a1e1;">-S</span> rustup rust-analyzer
</pre>
</div>
<ul class="org-ul">
<li>Install a toolchain and set it as default</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustup</span> default stable
</pre>
</div>
<ul class="org-ul">
<li>Update the toolchain (if needed)</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustup</span> update
</pre>
</div>
<ul class="org-ul">
<li>Install a different toolchain, where TOOLCHAIN is one of: stable, beta, nightly or 1.23.0</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustup</span> toolchain install TOOLCHAIN
</pre>
</div>
<ul class="org-ul">
<li>Install a toolchain for a different architecture, get the list of available architectures with:</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustup</span> target list
<span style="color: #c678dd;">rustup</span> toolchain install stable-x86_64-pc-windows-gnu
</pre>
</div>
<ul class="org-ul">
<li>Verify installed version</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustc</span> <span style="color: #a9a1e1;">-V</span>
</pre>
</div>
<ul class="org-ul">
<li>Add <code>sccache</code> to global rust config in <code>~/.cargo/config</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #ECBE7B;">build</span>]
<span style="color: #db5762;">rustc-wrapper</span> = <span style="color: #98be65;">"sccache"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9473990" class="outline-3">
<h3 id="org9473990"><span class="section-number-3">2.2.</span> Adding Components</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Add a component</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustup</span> component add COMPONENT_NAME
</pre>
</div>
<ul class="org-ul">
<li>Add the formatter and the language server</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">rustup</span> component add rustfmt
<span style="color: #c678dd;">rustup</span> component add rls
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge492285" class="outline-2">
<h2 id="orge492285"><span class="section-number-2">3.</span> Project Management</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
Creating a new project
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> new PROJECT_NAME
</pre>
</div></li>
<li><p>
Check for errors
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> check
</pre>
</div></li>
<li><p>
Building a project
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> build
</pre>
</div></li>
<li><p>
Building a project for release
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> build <span style="color: #a9a1e1;">--release</span>
</pre>
</div></li>
<li><p>
Running a project
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> run
</pre>
</div></li>
<li><p>
Updating dependencies
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> update
</pre>
</div></li>
<li><p>
Build current dependencies' documentation and open in a browser
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">cargo</span> doc <span style="color: #a9a1e1;">--open</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orge6ef7f7" class="outline-2">
<h2 id="orge6ef7f7"><span class="section-number-2">4.</span> Basics</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4080887" class="outline-3">
<h3 id="org4080887"><span class="section-number-3">4.1.</span> Starting point <code>main</code> function</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">//</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org867f084" class="outline-3">
<h3 id="org867f084"><span class="section-number-3">4.2.</span> Printing output</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">use</span> <span style="color: #a9a1e1;">std</span><span style="color: #bbc2cf;">::</span>io<span style="color: #bbc2cf;">;</span>
<span style="color: #5B6268;">// in main...</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">x</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">5</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">y</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">10</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Hello world"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// it's a macro for printing to stdout</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Var x = {x}"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// string interpolation</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Hello world var x = {}, var y = {}"</span>, x, y<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// string interpolation</span>
</pre>
</div>
</div>
</div>
