notes/resources/rust/rust.org
** Declaring variables
   - Variables a immutable by default
   - Add ~mut~ to make a variable mutable
   #+begin_src rust
     let apples = 5; // immutable
     let mut bananas = 5; // mutables

     let string = String::new(); // string
   #+end_src
   - Declaring variables with a type
   #+begin_src rust
     let apples: i32 = 5;
     let string: String = String::new();
   #+end_src
** Declaring constants
   - Can not use ~mut~ with constant
   - Are always immutable
   - Type *MUST* be annotated
   #+begin_src rust
     const MY_CONST: u32 = 45;
   #+end_src
** Getting a String input from ~stdin~
   - References are immutable by default so we use ~& mut~ to make the reference mutable
   - Remember to ~use std::io;~
   #+begin_src rust
     let mut in_string = String::new();
     io::stdin()
         .read_line(&mut in_string)
         .expect("Failed to read line");
   #+end_src
* Statements and Expressions
  - *Statements* are instructions and perform actions, but do not return any values. E.g. a function declaration
  - *Expressions* evaluate to a value being returned. E.g. ~5~, ~4 + 5~
* Variable shadowing
  - It is allowed to use the same variable name one after another, the previous one simply ceases to exist
  - The advantage over ~mut~ is that the variable remains immutable and allows to change the type. The most basic example of this is [[id:jy9az9g04jj0][Type Casting]]. Furthermore, it reduces the amount of variable names needed to be thought of when type casting, i.e. ~guess_str~, ~guess_int~...etc. Here we'll simply just have ~guess~:
    #+begin_src rust
      let guess = "45";
      let guess: u32 = guess.parse().expect("Not a number");
    #+end_src
* Error Handling and the ~Result enum~
** Basic error handling with ~expect~
   - ~expect("Failed to read line")~, ~expect~ is called when a ~Result~ calls ~Err~, in this case ~read_line()~ could potentially return an ~Err~. If the ~Result~ is ~Ok~ the ~expect~ will pass on the value of ~Ok~, in this case ~expect~ would return the length of the string
   #+begin_src rust
     let mut in_string = String::new();
     io::stdin()
         .read_line(&mut in_string)
         .expect("Failed to read line");
   #+end_src
** Error handling with ~match~
   - Here we use ~_~ in the ~Err~ as a "catchall", which means that we handle *ALL* errors that may occur.
   #+begin_src rust
     let guess: u32 = match guess.trim().parse() {
         Ok(num) => num,
         Err(_) => panic!("Not a number!"),
     };
   #+end_src
* Comparing Values with ~Ordering~ and ~match~
** We can compare values with the ~Ordering~ enum
   - import it with ~use std::cmp::Ordering;~
** Sample code
   #+begin_src rust
     match guess.cmp(&secret_number) {
         Ordering::Less => println!("Too small!"),
         Ordering::Greater => println!("Too big!"),
         Ordering::Equal => println!("You win!"),
     }
   #+end_src
   - ~secret_number~ is being compared with ~guess~, both are ~ints~ in this case
* Random number generation
