notes/resources/rust/rust.html
<div id="outline-container-org5cb8c94" class="outline-3">
<h3 id="org5cb8c94"><span class="section-number-3">4.3.</span> Declaring variables</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Variables a immutable by default</li>
<li>Add <code>mut</code> to make a variable mutable</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">apples</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">5</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// immutable</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">bananas</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">5</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// mutables</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">string</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">new</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// string</span>
</pre>
</div>
<ul class="org-ul">
<li>Declaring variables with a type</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">apples</span>: <span style="color: #ECBE7B;">i32</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">5</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">string</span>: <span style="color: #ECBE7B;">String</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">new</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfd42771" class="outline-3">
<h3 id="orgfd42771"><span class="section-number-3">4.4.</span> Declaring constants</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Can not use <code>mut</code> with constant</li>
<li>Are always immutable</li>
<li>Type <b>MUST</b> be annotated</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">const</span> <span style="color: #a9a1e1;">MY_CONST</span>: <span style="color: #ECBE7B;">u32</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">45</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5dcaef2" class="outline-3">
<h3 id="org5dcaef2"><span class="section-number-3">4.5.</span> Getting a String input from <code>stdin</code></h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>References are immutable by default so we use <code>&amp; mut</code> to make the reference mutable</li>
<li>Remember to <code>use std::io;</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">in_string</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">new</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">;</span>
<span style="color: #a9a1e1;">io</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">stdin</span><span style="color: #fff0f5;">()</span>
    <span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">read_line</span><span style="color: #fff0f5;">(</span><span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> in_string<span style="color: #fff0f5;">)</span>
    <span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">expect</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Failed to read line"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a1431b" class="outline-2">
<h2 id="org3a1431b"><span class="section-number-2">5.</span> Statements and Expressions</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b>Statements</b> are instructions and perform actions, but do not return any values. E.g. a function declaration</li>
<li><b>Expressions</b> evaluate to a value being returned. E.g. <code>5</code>, <code>4 + 5</code></li>
</ul>
</div>
</div>
<div id="outline-container-org3ba9b67" class="outline-2">
<h2 id="org3ba9b67"><span class="section-number-2">6.</span> Variable shadowing</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>It is allowed to use the same variable name one after another, the previous one simply ceases to exist</li>
<li><p>
The advantage over <code>mut</code> is that the variable remains immutable and allows to change the type. The most basic example of this is <a href="#org93e143f">Type Casting</a>. Furthermore, it reduces the amount of variable names needed to be thought of when type casting, i.e. <code>guess_str</code>, <code>guess_int</code>&#x2026;etc. Here we'll simply just have <code>guess</code>:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">guess</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">"45"</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">guess</span>: <span style="color: #ECBE7B;">u32</span> <span style="color: #bbc2cf;">=</span> guess<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">parse</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">expect</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Not a number"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgd08576f" class="outline-2">
<h2 id="orgd08576f"><span class="section-number-2">7.</span> Error Handling and the <code>Result enum</code></h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgdf3cd17" class="outline-3">
<h3 id="orgdf3cd17"><span class="section-number-3">7.1.</span> Basic error handling with <code>expect</code></h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><code>expect("Failed to read line")</code>, <code>expect</code> is called when a <code>Result</code> calls <code>Err</code>, in this case <code>read_line()</code> could potentially return an <code>Err</code>. If the <code>Result</code> is <code>Ok</code> the <code>expect</code> will pass on the value of <code>Ok</code>, in this case <code>expect</code> would return the length of the string</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">in_string</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">new</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">;</span>
<span style="color: #a9a1e1;">io</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">stdin</span><span style="color: #fff0f5;">()</span>
    <span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">read_line</span><span style="color: #fff0f5;">(</span><span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> in_string<span style="color: #fff0f5;">)</span>
    <span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">expect</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Failed to read line"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4b4b4d" class="outline-3">
<h3 id="orgb4b4b4d"><span class="section-number-3">7.2.</span> Error handling with <code>match</code></h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Here we use <code>_</code> in the <code>Err</code> as a "catchall", which means that we handle <b>ALL</b> errors that may occur.</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">guess</span>: <span style="color: #ECBE7B;">u32</span> <span style="color: #bbc2cf;">=</span> <span style="color: #51afef; font-style: italic;">match</span> guess<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">trim</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">parse</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef;">Ok</span><span style="color: #c678dd;">(</span>num<span style="color: #c678dd;">)</span> =&gt; num,
    <span style="color: #51afef;">Err</span><span style="color: #c678dd;">(</span>_<span style="color: #c678dd;">)</span> =&gt; <span style="color: #51afef; font-weight: bold;">panic!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"Not a number!"</span><span style="color: #c678dd;">)</span>,
<span style="color: #fff0f5;">}</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org630d6d7" class="outline-2">
<h2 id="org630d6d7"><span class="section-number-2">8.</span> Comparing Values with <code>Ordering</code> and <code>match</code></h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgc16cf6b" class="outline-3">
<h3 id="orgc16cf6b"><span class="section-number-3">8.1.</span> We can compare values with the <code>Ordering</code> enum</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>import it with <code>use std::cmp::Ordering;</code></li>
</ul>
</div>
</div>
<div id="outline-container-org73f8869" class="outline-3">
<h3 id="org73f8869"><span class="section-number-3">8.2.</span> Sample code</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">match</span> guess<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">cmp</span><span style="color: #fff0f5;">(</span><span style="color: #bbc2cf;">&amp;</span>secret_number<span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #ECBE7B;">Ordering</span><span style="color: #bbc2cf;">::</span><span style="color: #51afef;">Less</span> =&gt; <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"Too small!"</span><span style="color: #c678dd;">)</span>,
    <span style="color: #ECBE7B;">Ordering</span><span style="color: #bbc2cf;">::</span><span style="color: #51afef;">Greater</span> =&gt; <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"Too big!"</span><span style="color: #c678dd;">)</span>,
    <span style="color: #ECBE7B;">Ordering</span><span style="color: #bbc2cf;">::</span><span style="color: #51afef;">Equal</span> =&gt; <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"You win!"</span><span style="color: #c678dd;">)</span>,
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li><code>secret_number</code> is being compared with <code>guess</code>, both are <code>ints</code> in this case</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2e4057d" class="outline-2">
<h2 id="org2e4057d"><span class="section-number-2">9.</span> Random number generation</h2>
<div class="outline-text-2" id="text-9">
</div>
