notes/resources/rust/rust.org
** Add ~rand~ to the ~cargo.toml~ file
   #+begin_src conf
     [dependencies]
     rand = "0.8.3"
   #+end_src
** Using rand
   - Import the lib with ~use rand:Rng;~
   - Generate a number between 1 and 100 (inclusive)
     #+begin_src rust
       let generated_number = rand::thread_rng().gen_range(1..=100);
     #+end_src
* Type Casting
  :PROPERTIES:
  :ID:       jy9az9g04jj0
  :END:
** Strings
   - Denote the type casted to, in the variable declaration, here it is ~u32~. Call ~parse~ on the ~String~ variable.
     #+begin_src rust
       let my_guess = "45";
       let my_guess = my_guess.trim().parse().expect("Not a number!")
     #+end_src
* Data Types
** Scalar, four primitive types
*** Integer
**** Individual Integer Types
     | Length  | Signed          | Unsigned |
     |---------+-----------------+----------|
     | 8 bit   | ~i8~            | ~u8~     |
     | 16 bit  | ~i16~           | ~u16~    |
     | 32 bit  | ~i32~ (default) | ~u32~    |
     | 64 bit  | ~i64~           | ~u64~    |
     | 128 bit | ~i128~          | ~u128~   |
     | arch    | ~isize~         | ~usize~  |
**** Integer Literals
     | Literal              | Example       | Equivalent |
     |----------------------+---------------+------------|
     | Number (type suffix) | ~58u8~        |         58 |
     | Number               | ~1_000~       |       1000 |
     | Decimal              | ~86_400~      |     86.400 |
     | Hex                  | ~0xff~        |            |
     | Octal                | ~0o77~        |            |
     | Binary               | ~0b1111_0000~ |            |
     | Byte (u8 only)       | ~b'A'~        |            |
*** Float
**** Individual Float Types
     | Length           | Notation |
     |------------------+----------|
     | 32 bit           | ~f32~    |
     | 64 bit (default) | ~f64~    |
*** Boolean
**** The Boolean type is ~bool~
**** Values are: ~true~ and ~false~
*** Char
**** Properties
     - Is the most primitive alphabetical type in Rust
**** Example of declaring a ~char~
     #+begin_src rust
       let c = 'z';
       let z: char = 'ℤ'; // with explicit type annotation
       let heart_eyed_cat = '😻';
     #+end_src
** Compound
*** Tuple
**** Properties
     - Fixed length, cannot grow or shrink
     - Supports a variety of types in each tuple's position
**** Declaration, Destructuring and Position Access
     #+begin_src rust
       let tup: (i32, f64, u8) = (500, 6.4, 1);
       let (x, y, z) = tup;

       println!("The value of y is: {y}");
       println!("The value at first position is: {tup.0}");
       println!("The value at second position is: {tup.1}");
     #+end_src
**** Unit
     - A ~unit~ is an empty tuple and is denoted as ~()~
     - A ~unit~ represents an empty value or an empty return type
     - Expressions implicitly return the ~unit~ value if they don’t return any other value
*** Array
**** Properties
     - Every element has to be of the same type
     - Have a fixed length
     - Is allocated on the Stack
     - Provides a check of *out of bounds* error at runtime and causes a ~panic~
