notes/resources/rust/rust.html
<div id="outline-container-org03f48b1" class="outline-3">
<h3 id="org03f48b1"><span class="section-number-3">9.1.</span> Add <code>rand</code> to the <code>cargo.toml</code> file</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #ECBE7B;">dependencies</span>]
<span style="color: #db5762;">rand</span> = <span style="color: #98be65;">"0.8.3"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee6e3aa" class="outline-3">
<h3 id="orgee6e3aa"><span class="section-number-3">9.2.</span> Using rand</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Import the lib with <code>use rand:Rng;</code></li>
<li><p>
Generate a number between 1 and 100 (inclusive)
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">generated_number</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">rand</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">thread_rng</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">gen_range</span><span style="color: #fff0f5;">(</span><span style="color: #a9a1e1;">1</span>..=<span style="color: #a9a1e1;">100</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org93e143f" class="outline-2">
<h2 id="org93e143f"><span class="section-number-2">10.</span> Type Casting</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgdc6f0e0" class="outline-3">
<h3 id="orgdc6f0e0"><span class="section-number-3">10.1.</span> Strings</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li><p>
Denote the type casted to, in the variable declaration, here it is <code>u32</code>. Call <code>parse</code> on the <code>String</code> variable.
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">my_guess</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">"45"</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">my_guess</span> <span style="color: #bbc2cf;">=</span> my_guess<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">trim</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">parse</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">expect</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Not a number!"</span><span style="color: #fff0f5;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1f61458" class="outline-2">
<h2 id="org1f61458"><span class="section-number-2">11.</span> Data Types</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org32d9ef0" class="outline-3">
<h3 id="org32d9ef0"><span class="section-number-3">11.1.</span> Scalar, four primitive types</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-org32e38ff" class="outline-4">
<h4 id="org32e38ff"><span class="section-number-4">11.1.1.</span> Integer</h4>
<div class="outline-text-4" id="text-11-1-1">
</div>
<ul class="org-ul">
<li><a id="org2f8272c"></a>Individual Integer Types<br />
<div class="outline-text-5" id="text-org2f8272c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Length</th>
<th scope="col" class="org-left">Signed</th>
<th scope="col" class="org-left">Unsigned</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">8 bit</td>
<td class="org-left"><code>i8</code></td>
<td class="org-left"><code>u8</code></td>
</tr>

<tr>
<td class="org-left">16 bit</td>
<td class="org-left"><code>i16</code></td>
<td class="org-left"><code>u16</code></td>
</tr>

<tr>
<td class="org-left">32 bit</td>
<td class="org-left"><code>i32</code> (default)</td>
<td class="org-left"><code>u32</code></td>
</tr>

<tr>
<td class="org-left">64 bit</td>
<td class="org-left"><code>i64</code></td>
<td class="org-left"><code>u64</code></td>
</tr>

<tr>
<td class="org-left">128 bit</td>
<td class="org-left"><code>i128</code></td>
<td class="org-left"><code>u128</code></td>
</tr>

<tr>
<td class="org-left">arch</td>
<td class="org-left"><code>isize</code></td>
<td class="org-left"><code>usize</code></td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org4f0f285"></a>Integer Literals<br />
<div class="outline-text-5" id="text-org4f0f285">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Literal</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-right">Equivalent</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Number (type suffix)</td>
<td class="org-left"><code>58u8</code></td>
<td class="org-right">58</td>
</tr>

<tr>
<td class="org-left">Number</td>
<td class="org-left"><code>1_000</code></td>
<td class="org-right">1000</td>
</tr>

<tr>
<td class="org-left">Decimal</td>
<td class="org-left"><code>86_400</code></td>
<td class="org-right">86.400</td>
</tr>

<tr>
<td class="org-left">Hex</td>
<td class="org-left"><code>0xff</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Octal</td>
<td class="org-left"><code>0o77</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Binary</td>
<td class="org-left"><code>0b1111_0000</code></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Byte (u8 only)</td>
<td class="org-left"><code>b'A'</code></td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgf30d789" class="outline-4">
<h4 id="orgf30d789"><span class="section-number-4">11.1.2.</span> Float</h4>
<div class="outline-text-4" id="text-11-1-2">
</div>
<ul class="org-ul">
<li><a id="orgb6f070d"></a>Individual Float Types<br />
<div class="outline-text-5" id="text-orgb6f070d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Length</th>
<th scope="col" class="org-left">Notation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">32 bit</td>
<td class="org-left"><code>f32</code></td>
</tr>

<tr>
<td class="org-left">64 bit (default)</td>
<td class="org-left"><code>f64</code></td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>
<div id="outline-container-org074ee26" class="outline-4">
<h4 id="org074ee26"><span class="section-number-4">11.1.3.</span> Boolean</h4>
<div class="outline-text-4" id="text-11-1-3">
</div>
<ul class="org-ul">
<li><a id="org71fb802"></a>The Boolean type is <code>bool</code><br /></li>
<li><a id="org5eb433e"></a>Values are: <code>true</code> and <code>false</code><br /></li>
</ul>
</div>
<div id="outline-container-orgf4ec95d" class="outline-4">
<h4 id="orgf4ec95d"><span class="section-number-4">11.1.4.</span> Char</h4>
<div class="outline-text-4" id="text-11-1-4">
</div>
<ul class="org-ul">
<li><a id="org0992621"></a>Properties<br />
<div class="outline-text-5" id="text-org0992621">
<ul class="org-ul">
<li>Is the most primitive alphabetical type in Rust</li>
</ul>
</div>
</li>
<li><a id="org5a652d1"></a>Example of declaring a <code>char</code><br />
<div class="outline-text-5" id="text-org5a652d1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">c</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">'z'</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">z</span>: <span style="color: #ECBE7B;">char</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">'&#8484;'</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// with explicit type annotation</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">heart_eyed_cat</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">'&#128571;'</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdad60f1" class="outline-3">
<h3 id="orgdad60f1"><span class="section-number-3">11.2.</span> Compound</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-orgcbffb47" class="outline-4">
<h4 id="orgcbffb47"><span class="section-number-4">11.2.1.</span> Tuple</h4>
<div class="outline-text-4" id="text-11-2-1">
</div>
<ul class="org-ul">
<li><a id="org7432adc"></a>Properties<br />
<div class="outline-text-5" id="text-org7432adc">
<ul class="org-ul">
<li>Fixed length, cannot grow or shrink</li>
<li>Supports a variety of types in each tuple's position</li>
</ul>
</div>
</li>
<li><a id="org1321bb7"></a>Declaration, Destructuring and Position Access<br />
<div class="outline-text-5" id="text-org1321bb7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">tup</span>: <span style="color: #fff0f5;">(</span><span style="color: #ECBE7B;">i32</span>, <span style="color: #ECBE7B;">f64</span>, <span style="color: #ECBE7B;">u8</span><span style="color: #fff0f5;">)</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">(</span><span style="color: #a9a1e1;">500</span>, <span style="color: #a9a1e1;">6.4</span>, <span style="color: #a9a1e1;">1</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #fff0f5;">(</span><span style="color: #db5762;">x</span>, <span style="color: #db5762;">y</span>, <span style="color: #db5762;">z</span><span style="color: #fff0f5;">)</span> <span style="color: #bbc2cf;">=</span> tup<span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"The value of y is: {y}"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"The value at first position is: {tup.0}"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"The value at second position is: {tup.1}"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</li>
<li><a id="org03e603a"></a>Unit<br />
<div class="outline-text-5" id="text-org03e603a">
<ul class="org-ul">
<li>A <code>unit</code> is an empty tuple and is denoted as <code>()</code></li>
<li>A <code>unit</code> represents an empty value or an empty return type</li>
<li>Expressions implicitly return the <code>unit</code> value if they don’t return any other value</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org95b03ea" class="outline-4">
<h4 id="org95b03ea"><span class="section-number-4">11.2.2.</span> Array</h4>
<div class="outline-text-4" id="text-11-2-2">
</div>
<ul class="org-ul">
<li><a id="org57d9cf8"></a>Properties<br />
<div class="outline-text-5" id="text-org57d9cf8">
<ul class="org-ul">
<li>Every element has to be of the same type</li>
<li>Have a fixed length</li>
<li>Is allocated on the Stack</li>
<li>Provides a check of <b>out of bounds</b> error at runtime and causes a <code>panic</code></li>
</ul>
</div>
</li>
