notes/resources/rust/rust.org
**** Declaration
     #+begin_src rust
       let arr = [4, 8, 9]; // type inferred
       let arr: [i32; 3] = [4, 8, 9]; // type; length provided
       let arr = [3; 5]; // is equivalent to [3, 3, 3, 3, 3]
     #+end_src
**** Accessing Elements
     #+begin_src rust
       let arr = [4, 8, 9]; // type inferred
       let first_element = arr[0];
       let second_element = arr[1];
     #+end_src
* Functions
** Declaring a function
   - Functions are declared with the ~fn~ keyword
   - The rest is standard, as in: parameters/arguments in brackets and the function body in curly brackets
   - The return type is declared with this ~->~ symbol follow by the type, e.g. ~-> i32~
** Examples
   #+begin_src rust
     fn main() {
         another_function();
         print_value(44);
         let result = multiply_by_two(40);
     }

     fn another_function() {
         println!("Hello, world!");
     }

     fn print_value(value: i32) {
         println!("Value is: {value}");
     }

     // Note that we don't need to write return if it is a simple example
     // Also note that there is no semicolon for this implicit return type
     fn multiply_by_two(value: i32) -> i32 {
         value * 2
     }
   #+end_src
* Control Flow
** ~if~ Statements
   - Are the same as in any other language
   - Strictly require a ~bool~
   - Standard combinations of ~if~, ~else if~, ~else~ are valid
*** ~if~ in a ~let~
    - The example below will return either a 5 or a 6 depending on the ~condition~
    - This is a nifty feature of Rust's expressions that are capable of returning values
    - Remember that chains of ~if~, ~else if~, ~else~ must all return the same type, otherwise the type would be mixed, which is not allowed
    #+begin_src rust
      let number = if condition { 5 } else { 6 };
    #+end_src
** Infinite ~loop~
*** ~loop~ Example
   #+begin_src rust
     loop {
         // infinite loop code here
         // exit out of loop with break
         break;
     }
   #+end_src
*** Returning a value from a ~loop~ with ~break~
    #+begin_src rust
      let result = loop {
          counter += 1;

          if counter == 10 {
              break counter * 2;
          }
      };
    #+end_src
