notes/resources/rust/rust.html
<li><a id="orgaf9aedd"></a>Declaration<br />
<div class="outline-text-5" id="text-orgaf9aedd">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">arr</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">4</span>, <span style="color: #a9a1e1;">8</span>, <span style="color: #a9a1e1;">9</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// type inferred</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">arr</span>: <span style="color: #fff0f5;">[</span><span style="color: #ECBE7B;">i32</span><span style="color: #bbc2cf;">;</span> <span style="color: #a9a1e1;">3</span><span style="color: #fff0f5;">]</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">4</span>, <span style="color: #a9a1e1;">8</span>, <span style="color: #a9a1e1;">9</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// type; length provided</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">arr</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">3</span><span style="color: #bbc2cf;">;</span> <span style="color: #a9a1e1;">5</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// is equivalent to [3, 3, 3, 3, 3]</span>
</pre>
</div>
</div>
</li>
<li><a id="orgacbdeed"></a>Accessing Elements<br />
<div class="outline-text-5" id="text-orgacbdeed">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">arr</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">4</span>, <span style="color: #a9a1e1;">8</span>, <span style="color: #a9a1e1;">9</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// type inferred</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">first_element</span> <span style="color: #bbc2cf;">=</span> arr<span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">0</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">second_element</span> <span style="color: #bbc2cf;">=</span> arr<span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">1</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5c4581f" class="outline-2">
<h2 id="org5c4581f"><span class="section-number-2">12.</span> Functions</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orge551f13" class="outline-3">
<h3 id="orge551f13"><span class="section-number-3">12.1.</span> Declaring a function</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>Functions are declared with the <code>fn</code> keyword</li>
<li>The rest is standard, as in: parameters/arguments in brackets and the function body in curly brackets</li>
<li>The return type is declared with this <code>-&gt;</code> symbol follow by the type, e.g. <code>-&gt; i32</code></li>
</ul>
</div>
</div>
<div id="outline-container-org6c3caf3" class="outline-3">
<h3 id="org6c3caf3"><span class="section-number-3">12.2.</span> Examples</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #c678dd;">another_function</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #c678dd;">print_value</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">44</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">result</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">multiply_by_two</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">40</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">another_function</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"Hello, world!"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">print_value</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">value</span>: <span style="color: #ECBE7B;">i32</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"Value is: {value}"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #5B6268;">// Note that we don't need to write return if it is a simple example</span>
<span style="color: #5B6268;">// Also note that there is no semicolon for this implicit return type</span>
<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">multiply_by_two</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">value</span>: <span style="color: #ECBE7B;">i32</span><span style="color: #fff0f5;">)</span> -&gt; <span style="color: #ECBE7B;">i32</span> <span style="color: #fff0f5;">{</span>
    value <span style="color: #bbc2cf;">*</span> <span style="color: #a9a1e1;">2</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf134a75" class="outline-2">
<h2 id="orgf134a75"><span class="section-number-2">13.</span> Control Flow</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgb5a6d39" class="outline-3">
<h3 id="orgb5a6d39"><span class="section-number-3">13.1.</span> <code>if</code> Statements</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>Are the same as in any other language</li>
<li>Strictly require a <code>bool</code></li>
<li>Standard combinations of <code>if</code>, <code>else if</code>, <code>else</code> are valid</li>
</ul>
</div>
<div id="outline-container-org5f141d2" class="outline-4">
<h4 id="org5f141d2"><span class="section-number-4">13.1.1.</span> <code>if</code> in a <code>let</code></h4>
<div class="outline-text-4" id="text-13-1-1">
<ul class="org-ul">
<li>The example below will return either a 5 or a 6 depending on the <code>condition</code></li>
<li>This is a nifty feature of Rust's expressions that are capable of returning values</li>
<li>Remember that chains of <code>if</code>, <code>else if</code>, <code>else</code> must all return the same type, otherwise the type would be mixed, which is not allowed</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">number</span> <span style="color: #bbc2cf;">=</span> <span style="color: #51afef; font-style: italic;">if</span> condition <span style="color: #fff0f5;">{</span> <span style="color: #a9a1e1;">5</span> <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">else</span> <span style="color: #fff0f5;">{</span> <span style="color: #a9a1e1;">6</span> <span style="color: #fff0f5;">}</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge0260ab" class="outline-3">
<h3 id="orge0260ab"><span class="section-number-3">13.2.</span> Infinite <code>loop</code></h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-org8b721b8" class="outline-4">
<h4 id="org8b721b8"><span class="section-number-4">13.2.1.</span> <code>loop</code> Example</h4>
<div class="outline-text-4" id="text-13-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">loop</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">// infinite loop code here</span>
    <span style="color: #5B6268;">// exit out of loop with break</span>
    <span style="color: #51afef; font-style: italic;">break</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7590276" class="outline-4">
<h4 id="org7590276"><span class="section-number-4">13.2.2.</span> Returning a value from a <code>loop</code> with <code>break</code></h4>
<div class="outline-text-4" id="text-13-2-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">result</span> <span style="color: #bbc2cf;">=</span> <span style="color: #51afef; font-style: italic;">loop</span> <span style="color: #fff0f5;">{</span>
    counter += <span style="color: #a9a1e1;">1</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">if</span> counter <span style="color: #bbc2cf;">==</span> <span style="color: #a9a1e1;">10</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-style: italic;">break</span> counter <span style="color: #bbc2cf;">*</span> <span style="color: #a9a1e1;">2</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
