notes/resources/rust/rust.org
*** Using ~loop~ labels
    - Labels *MUST* start with a single apostrophe
    #+begin_src rust
      fn main() {
          let mut count = 0;
          'counting_up: loop {
              println!("count = {count}");
              let mut remaining = 10;

              loop {
                  println!("remaining = {remaining}");
                  if remaining == 9 {
                      break;
                  }
                  if count == 2 {
                      break 'counting_up;
                  }
                  remaining -= 1;
              }

              count += 1;
          }
          println!("End count = {count}");
      }
    #+end_src
** Conditional ~while~ loop
   - Works the exact same way as in most languages, expect the missing brackets
   #+begin_src rust
     let mut number = 3;

     while number != 0 {
         println!("{number}!");

         number -= 1;
     }
   #+end_src
** Looping through Collections with ~for~
*** Looping over an array
    #+begin_src rust
      let a = [10, 20, 30, 40, 50];

      for element in a {
          println!("the value is: {element}");
      }
    #+end_src
*** Example of using a ~Range~
    #+begin_src rust
      // forward count
      for number in (1..4) {
          println!("{number}!");
      }
      // backward count (reversing the Range with rev())
      for number in (1..4).rev() {
          println!("{number}!");
      }
    #+end_src
*** Enumerating a collection
    - Calling ~enumerate~ on a ~iterable~ will return a tuple (index, &item).
    #+begin_src rust
      let s = String::from("Hello World");
      let bytes = s.as_bytes();

      for (i, &item) in bytes.iter().enumerate() {
          // do something with i
          // do something with &item
      }
    #+end_src
* Ownership
** Rules
   - Each value in Rust has an owner.
   - There can only be one owner at a time.
   - When the owner goes out of scope, the value will be dropped.
** Basic example of Ownership
   #+begin_src rust
     fn main() {
         {                      // s is not valid here, it’s not yet declared
             let s = "hello";   // s is valid from this point forward

             // do stuff with s
         }                      // this scope is now over, and s is no longer valid
     }
   #+end_src
** Transferring Ownership
