notes/resources/rust/rust.html
<div id="outline-container-orgb5125d2" class="outline-4">
<h4 id="orgb5125d2"><span class="section-number-4">13.2.3.</span> Using <code>loop</code> labels</h4>
<div class="outline-text-4" id="text-13-2-3">
<ul class="org-ul">
<li>Labels <b>MUST</b> start with a single apostrophe</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">count</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">0</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #bbc2cf;">'</span>counting_up: <span style="color: #51afef; font-style: italic;">loop</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"count = {count}"</span><span style="color: #98be65;">)</span><span style="color: #bbc2cf;">;</span>
        <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">remaining</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">10</span><span style="color: #bbc2cf;">;</span>

        <span style="color: #51afef; font-style: italic;">loop</span> <span style="color: #98be65;">{</span>
            <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #00bfff;">(</span><span style="color: #98be65;">"remaining = {remaining}"</span><span style="color: #00bfff;">)</span><span style="color: #bbc2cf;">;</span>
            <span style="color: #51afef; font-style: italic;">if</span> remaining <span style="color: #bbc2cf;">==</span> <span style="color: #a9a1e1;">9</span> <span style="color: #00bfff;">{</span>
                <span style="color: #51afef; font-style: italic;">break</span><span style="color: #bbc2cf;">;</span>
            <span style="color: #00bfff;">}</span>
            <span style="color: #51afef; font-style: italic;">if</span> count <span style="color: #bbc2cf;">==</span> <span style="color: #a9a1e1;">2</span> <span style="color: #00bfff;">{</span>
                <span style="color: #51afef; font-style: italic;">break</span> <span style="color: #bbc2cf;">'</span>counting_up<span style="color: #bbc2cf;">;</span>
            <span style="color: #00bfff;">}</span>
            remaining -= <span style="color: #a9a1e1;">1</span><span style="color: #bbc2cf;">;</span>
        <span style="color: #98be65;">}</span>

        count += <span style="color: #a9a1e1;">1</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #c678dd;">}</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"End count = {count}"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9c5a2a6" class="outline-3">
<h3 id="org9c5a2a6"><span class="section-number-3">13.3.</span> Conditional <code>while</code> loop</h3>
<div class="outline-text-3" id="text-13-3">
<ul class="org-ul">
<li>Works the exact same way as in most languages, expect the missing brackets</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">number</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">3</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">while</span> number <span style="color: #bbc2cf;">!=</span> <span style="color: #a9a1e1;">0</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"{number}!"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    number -= <span style="color: #a9a1e1;">1</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd57f65" class="outline-3">
<h3 id="orgdd57f65"><span class="section-number-3">13.4.</span> Looping through Collections with <code>for</code></h3>
<div class="outline-text-3" id="text-13-4">
</div>
<div id="outline-container-org71d0aac" class="outline-4">
<h4 id="org71d0aac"><span class="section-number-4">13.4.1.</span> Looping over an array</h4>
<div class="outline-text-4" id="text-13-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">a</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">10</span>, <span style="color: #a9a1e1;">20</span>, <span style="color: #a9a1e1;">30</span>, <span style="color: #a9a1e1;">40</span>, <span style="color: #a9a1e1;">50</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">for</span> <span style="color: #db5762;">element</span> <span style="color: #51afef; font-style: italic;">in</span> a <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"the value is: {element}"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org839bff1" class="outline-4">
<h4 id="org839bff1"><span class="section-number-4">13.4.2.</span> Example of using a <code>Range</code></h4>
<div class="outline-text-4" id="text-13-4-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #5B6268;">// forward count</span>
<span style="color: #51afef; font-style: italic;">for</span> <span style="color: #db5762;">number</span> <span style="color: #51afef; font-style: italic;">in</span> <span style="color: #fff0f5;">(</span><span style="color: #a9a1e1;">1</span>..<span style="color: #a9a1e1;">4</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"{number}!"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
<span style="color: #5B6268;">// backward count (reversing the Range with rev())</span>
<span style="color: #51afef; font-style: italic;">for</span> <span style="color: #db5762;">number</span> <span style="color: #51afef; font-style: italic;">in</span> <span style="color: #fff0f5;">(</span><span style="color: #a9a1e1;">1</span>..<span style="color: #a9a1e1;">4</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">rev</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"{number}!"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbdc3ce6" class="outline-4">
<h4 id="orgbdc3ce6"><span class="section-number-4">13.4.3.</span> Enumerating a collection</h4>
<div class="outline-text-4" id="text-13-4-3">
<ul class="org-ul">
<li>Calling <code>enumerate</code> on a <code>iterable</code> will return a tuple (index, &amp;item).</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Hello World"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">bytes</span> <span style="color: #bbc2cf;">=</span> s<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">as_bytes</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">for</span> <span style="color: #fff0f5;">(</span><span style="color: #db5762;">i</span>, <span style="color: #bbc2cf;">&amp;</span>item<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">in</span> bytes<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">iter</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">enumerate</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">// do something with i</span>
    <span style="color: #5B6268;">// do something with &amp;item</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbb41c92" class="outline-2">
<h2 id="orgbb41c92"><span class="section-number-2">14.</span> Ownership</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgbc3f7ad" class="outline-3">
<h3 id="orgbc3f7ad"><span class="section-number-3">14.1.</span> Rules</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>Each value in Rust has an owner.</li>
<li>There can only be one owner at a time.</li>
<li>When the owner goes out of scope, the value will be dropped.</li>
</ul>
</div>
</div>
<div id="outline-container-org5477472" class="outline-3">
<h3 id="org5477472"><span class="section-number-3">14.2.</span> Basic example of Ownership</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #c678dd;">{</span>                      <span style="color: #5B6268;">// s is not valid here, it&#8217;s not yet declared</span>
        <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">"hello"</span><span style="color: #bbc2cf;">;</span>   <span style="color: #5B6268;">// s is valid from this point forward</span>

        <span style="color: #5B6268;">// do stuff with s</span>
    <span style="color: #c678dd;">}</span>                      <span style="color: #5B6268;">// this scope is now over, and s is no longer valid</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge00273a" class="outline-3">
<h3 id="orge00273a"><span class="section-number-3">14.3.</span> Transferring Ownership</h3>
<div class="outline-text-3" id="text-14-3">
</div>
