notes/resources/rust/rust.org
*** Basics
   - Keeping the rules of ownership in mind the code below will cause an error
   #+begin_src rust
     let s1 = String::from("hello");
     let s2 = s1; // s1 moved to s2 here (literally the pointer has moved and s1 is dropped)

     println!("{}, world!", s1); // s1 is not available anymore
   #+end_src
   - But writing it like this causes no errors
   #+begin_src rust
     let s1 = String::from("hello");
     println!("{}, world!", s1); // s1 is still valid here

     let s2 = s1; // s1 is not valid anymore, because its ownership moves to s2
     println!("{}, world!", s2);
   #+end_src
   - One could also utilize cloning o make sure that both variables have ownership of their data. Please note that copying/cloning is automatic for primitive types.
   #+begin_src rust
     let s1 = String::from("hello");
     let s2 = s1.clone(); // cloning data, i.e. a new pointer is created here

     println!("s1 = {}, s2 = {}", s1, s2);
   #+end_src
   - Rust's uniqueness is all about keeping a track of pointers to data on the heap and reassuring that there is always only one owner of the data
   - So what about functions? Well, functions can take the ownership and give it back, or they can utilize [[id:dxr2x4j09jj0][Borrowing]] to temporarily gain access, but not the ownership
*** Example of function that takes ownership and an example of a function that makes a copy (due to the parameter being a primitive)
   #+begin_src rust
     fn main() {
         let s = String::from("hello");  // s comes into scope

         takes_ownership(s);             // s's value moves into the function...
                                         // ... and so is no longer valid here

         let x = 5;                      // x comes into scope

         makes_copy(x);                  // x would move into the function,
                                         // but i32 is Copy, so it's okay to still
                                         // use x afterward

     } // Here, x goes out of scope, then s. But because s's value was moved, nothing
       // special happens.

     fn takes_ownership(some_string: String) { // some_string comes into scope
         println!("{}", some_string);
     } // Here, some_string goes out of scope and `drop` is called. The backing
       // memory is freed.

     fn makes_copy(some_integer: i32) { // some_integer comes into scope
         println!("{}", some_integer);
     } // Here, some_integer goes out of scope. Nothing special happens.

   #+end_src
