notes/resources/rust/rust.html
<div id="outline-container-orgb603e3f" class="outline-4">
<h4 id="orgb603e3f"><span class="section-number-4">14.3.1.</span> Basics</h4>
<div class="outline-text-4" id="text-14-3-1">
<ul class="org-ul">
<li>Keeping the rules of ownership in mind the code below will cause an error</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s2</span> <span style="color: #bbc2cf;">=</span> s1<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// s1 moved to s2 here (literally the pointer has moved and s1 is dropped)</span>

<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"{}, world!"</span>, s1<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// s1 is not available anymore</span>
</pre>
</div>
<ul class="org-ul">
<li>But writing it like this causes no errors</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"{}, world!"</span>, s1<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// s1 is still valid here</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s2</span> <span style="color: #bbc2cf;">=</span> s1<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// s1 is not valid anymore, because its ownership moves to s2</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"{}, world!"</span>, s2<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
<ul class="org-ul">
<li>One could also utilize cloning o make sure that both variables have ownership of their data. Please note that copying/cloning is automatic for primitive types.</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s2</span> <span style="color: #bbc2cf;">=</span> s1<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">clone</span><span style="color: #fff0f5;">()</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// cloning data, i.e. a new pointer is created here</span>

<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"s1 = {}, s2 = {}"</span>, s1, s2<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
<ul class="org-ul">
<li>Rust's uniqueness is all about keeping a track of pointers to data on the heap and reassuring that there is always only one owner of the data</li>
<li>So what about functions? Well, functions can take the ownership and give it back, or they can utilize <a href="#org91434c5">Borrowing</a> to temporarily gain access, but not the ownership</li>
</ul>
</div>
</div>
<div id="outline-container-orge4bb3b3" class="outline-4">
<h4 id="orge4bb3b3"><span class="section-number-4">14.3.2.</span> Example of function that takes ownership and an example of a function that makes a copy (due to the parameter being a primitive)</h4>
<div class="outline-text-4" id="text-14-3-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>  <span style="color: #5B6268;">// s comes into scope</span>

    <span style="color: #c678dd;">takes_ownership</span><span style="color: #c678dd;">(</span>s<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>             <span style="color: #5B6268;">// s's value moves into the function...</span>
                                    <span style="color: #5B6268;">// ... and so is no longer valid here</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">x</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">5</span><span style="color: #bbc2cf;">;</span>                      <span style="color: #5B6268;">// x comes into scope</span>

    <span style="color: #c678dd;">makes_copy</span><span style="color: #c678dd;">(</span>x<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>                  <span style="color: #5B6268;">// x would move into the function,</span>
                                    <span style="color: #5B6268;">// but i32 is Copy, so it's okay to still</span>
                                    <span style="color: #5B6268;">// use x afterward</span>

<span style="color: #fff0f5;">}</span> <span style="color: #5B6268;">// Here, x goes out of scope, then s. But because s's value was moved, nothing</span>
  <span style="color: #5B6268;">// special happens.</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">takes_ownership</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">some_string</span>: <span style="color: #ECBE7B;">String</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span> <span style="color: #5B6268;">// some_string comes into scope</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"{}"</span>, some_string<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span> <span style="color: #5B6268;">// Here, some_string goes out of scope and `drop` is called. The backing</span>
  <span style="color: #5B6268;">// memory is freed.</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">makes_copy</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">some_integer</span>: <span style="color: #ECBE7B;">i32</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span> <span style="color: #5B6268;">// some_integer comes into scope</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"{}"</span>, some_integer<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span> <span style="color: #5B6268;">// Here, some_integer goes out of scope. Nothing special happens.</span>

</pre>
</div>
</div>
</div>
