notes/resources/rust/rust.org
*** Example of a function that takes ownership and gives it back
   #+begin_src rust
     fn main() {
         let s1 = gives_ownership();         // gives_ownership moves its return
                                             // value into s1

         let s2 = String::from("hello");     // s2 comes into scope

         let s3 = takes_and_gives_back(s2);  // s2 is moved into
                                             // takes_and_gives_back, which also
                                             // moves its return value into s3
     } // Here, s3 goes out of scope and is dropped. s2 was moved, so nothing
       // happens. s1 goes out of scope and is dropped.

     fn gives_ownership() -> String {             // gives_ownership will move its
                                                  // return value into the function
                                                  // that calls it

         let some_string = String::from("yours"); // some_string comes into scope

         some_string                              // some_string is returned and
                                                  // moves out to the calling
                                                  // function
     }

     // This function takes a String and returns one
     fn takes_and_gives_back(a_string: String) -> String { // a_string comes into
                                                           // scope

         a_string  // a_string is returned and moves out to the calling function
     }

   #+end_src
** Borrowing
   :PROPERTIES:
   :ID:       dxr2x4j09jj0
   :END:
   - Is what it sounds like. You literally borrow a value's ownership, without claiming ownership. The borrowing is done via *references*, as in the ampersand symbol, just like in many other languages.
*** Rules
    - At any given time, you can have either one mutable reference or any number of immutable references.
    - References must always be valid.
*** Basic example of a borrowed value
    - Here ~calculate_length~ borrows the ~String s~ and returns its length without the need to give back the ownership of ~s~, it is only borrowed
    - Borrows are immutable by default
    #+begin_src rust
      fn main() {
          let s1 = String::from("hello");

          let len = calculate_length(&s1);

          println!("The length of '{}' is {}.", s1, len);
      }

      fn calculate_length(s: &String) -> usize { // s is a reference to a String
          s.len()
      } // Here, s goes out of scope. But because it does not have ownership of what
        // it refers to, it is not dropped.
    #+end_src
*** If we want to borrow and change the value we must create a mutable reference with ~&mut Type~
    #+begin_src rust
      fn main() {
          let mut s = String::from("hello");

          change(&mut s);
      }

      fn change(some_string: &mut String) {
          some_string.push_str(", world");
      }
    #+end_src
