notes/resources/rust/rust.html
<div id="outline-container-org6be5908" class="outline-4">
<h4 id="org6be5908"><span class="section-number-4">14.3.3.</span> Example of a function that takes ownership and gives it back</h4>
<div class="outline-text-4" id="text-14-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">gives_ownership</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">;</span>         <span style="color: #5B6268;">// gives_ownership moves its return</span>
                                        <span style="color: #5B6268;">// value into s1</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s2</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>     <span style="color: #5B6268;">// s2 comes into scope</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s3</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">takes_and_gives_back</span><span style="color: #c678dd;">(</span>s2<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>  <span style="color: #5B6268;">// s2 is moved into</span>
                                        <span style="color: #5B6268;">// takes_and_gives_back, which also</span>
                                        <span style="color: #5B6268;">// moves its return value into s3</span>
<span style="color: #fff0f5;">}</span> <span style="color: #5B6268;">// Here, s3 goes out of scope and is dropped. s2 was moved, so nothing</span>
  <span style="color: #5B6268;">// happens. s1 goes out of scope and is dropped.</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">gives_ownership</span><span style="color: #fff0f5;">()</span> -&gt; <span style="color: #ECBE7B;">String</span> <span style="color: #fff0f5;">{</span>             <span style="color: #5B6268;">// gives_ownership will move its</span>
                                             <span style="color: #5B6268;">// return value into the function</span>
                                             <span style="color: #5B6268;">// that calls it</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">some_string</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"yours"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// some_string comes into scope</span>

    some_string                              <span style="color: #5B6268;">// some_string is returned and</span>
                                             <span style="color: #5B6268;">// moves out to the calling</span>
                                             <span style="color: #5B6268;">// function</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #5B6268;">// This function takes a String and returns one</span>
<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">takes_and_gives_back</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">a_string</span>: <span style="color: #ECBE7B;">String</span><span style="color: #fff0f5;">)</span> -&gt; <span style="color: #ECBE7B;">String</span> <span style="color: #fff0f5;">{</span> <span style="color: #5B6268;">// a_string comes into</span>
                                                      <span style="color: #5B6268;">// scope</span>

    a_string  <span style="color: #5B6268;">// a_string is returned and moves out to the calling function</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org91434c5" class="outline-3">
<h3 id="org91434c5"><span class="section-number-3">14.4.</span> Borrowing</h3>
<div class="outline-text-3" id="text-14-4">
<ul class="org-ul">
<li>Is what it sounds like. You literally borrow a value's ownership, without claiming ownership. The borrowing is done via <b>references</b>, as in the ampersand symbol, just like in many other languages.</li>
</ul>
</div>
<div id="outline-container-org97fe5ef" class="outline-4">
<h4 id="org97fe5ef"><span class="section-number-4">14.4.1.</span> Rules</h4>
<div class="outline-text-4" id="text-14-4-1">
<ul class="org-ul">
<li>At any given time, you can have either one mutable reference or any number of immutable references.</li>
<li>References must always be valid.</li>
</ul>
</div>
</div>
<div id="outline-container-org4db892a" class="outline-4">
<h4 id="org4db892a"><span class="section-number-4">14.4.2.</span> Basic example of a borrowed value</h4>
<div class="outline-text-4" id="text-14-4-2">
<ul class="org-ul">
<li>Here <code>calculate_length</code> borrows the <code>String s</code> and returns its length without the need to give back the ownership of <code>s</code>, it is only borrowed</li>
<li>Borrows are immutable by default</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">len</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">calculate_length</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>s1<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"The length of '{}' is {}."</span>, s1, len<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">calculate_length</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">s</span>: <span style="color: #bbc2cf;">&amp;</span><span style="color: #ECBE7B;">String</span><span style="color: #fff0f5;">)</span> -&gt; <span style="color: #ECBE7B;">usize</span> <span style="color: #fff0f5;">{</span> <span style="color: #5B6268;">// s is a reference to a String</span>
    s<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">len</span><span style="color: #c678dd;">()</span>
<span style="color: #fff0f5;">}</span> <span style="color: #5B6268;">// Here, s goes out of scope. But because it does not have ownership of what</span>
  <span style="color: #5B6268;">// it refers to, it is not dropped.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga3a5242" class="outline-4">
<h4 id="orga3a5242"><span class="section-number-4">14.4.3.</span> If we want to borrow and change the value we must create a mutable reference with <code>&amp;mut Type</code></h4>
<div class="outline-text-4" id="text-14-4-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #c678dd;">change</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> s<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">change</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">some_string</span>: <span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #ECBE7B;">String</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    some_string<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">push_str</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">", world"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
