notes/resources/rust/rust.org
*** Mixing immutable and mutable references
    - However, keep in mind that we can only have *ONE* mutable reference. The assumption is that the "other" reference may be not in sync with the first one if the first one is modified and therefore this code produces an error:
      #+begin_src rust
        let mut s = String::from("hello");

        let r1 = &mut s; // first mutable borrow
        let r2 = &mut s; // second mutable borrow (error)

        // error, trying to use first mutable borrow r1 here
        println!("{}, {}", r1, r2);
      #+end_src
    - The same applies to having one or more immutable references while trying to create a mutable reference. There is no guarantee that the immutable references will have the same data after the mutable reference changes its value.
    - Users of an immutable reference don’t expect the value to suddenly change out from under them! However, multiple immutable references are allowed because no one who is just reading the data has the ability to affect anyone else’s reading of the data. Example below shows and error with mixing immutable and mutable references causing an error:
    #+begin_src rust
      fn main() {
          let mut s = String::from("hello");

          let r1 = &s; // no problem
          let r2 = &s; // no problem
          let r3 = &mut s; // BIG PROBLEM

          println!("{}, {}, and {}", r1, r2, r3);
      }
    #+end_src
    - But this code will work just fine because we're using the immutable references before we create the mutable one:
    #+begin_src rust
      let mut s = String::from("hello");

      let r1 = &s; // no problem
      let r2 = &s; // no problem
      println!("{} and {}", r1, r2);
      // variables r1 and r2 will not be used after this point

      let r3 = &mut s; // no problem
      println!("{}", r3);
    #+end_src
*** Protection against Dangling Pointers
    - Example of a code that will cause an error because we're trying to create a dangling pointer without a lifecycle
    #+begin_src rust
      fn main() {
          let reference_to_nothing = dangle();
      }

      fn dangle() -> &String { // dangle returns a reference to a String

          let s = String::from("hello"); // s is a new String

          &s // we return a reference to the String, s
      } // Here, s goes out of scope, and is dropped. Its memory goes away.
        // Danger!

    #+end_src
    - The quick and easy solution is to return the value directly (it is a pointer under the hood either way...)
    #+begin_src rust
      fn main() {
          let string = no_dangle();
      }

      fn no_dangle() -> String {
          let s = String::from("hello");

          s
      }
    #+end_src
* Slice Type
** Definition
   - Slices let you reference a contiguous sequence of elements in a collection rather than the whole collection. A slice is a kind of reference, so it does not have ownership.
   - Internally a Slice contains the pointer to the start of the data and the length of the data
