notes/resources/rust/rust.html
<div id="outline-container-org9900958" class="outline-4">
<h4 id="org9900958"><span class="section-number-4">14.4.4.</span> Mixing immutable and mutable references</h4>
<div class="outline-text-4" id="text-14-4-4">
<ul class="org-ul">
<li><p>
However, keep in mind that we can only have <b>ONE</b> mutable reference. The assumption is that the "other" reference may be not in sync with the first one if the first one is modified and therefore this code produces an error:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// first mutable borrow</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r2</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// second mutable borrow (error)</span>

<span style="color: #5B6268;">// error, trying to use first mutable borrow r1 here</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"{}, {}"</span>, r1, r2<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div></li>
<li>The same applies to having one or more immutable references while trying to create a mutable reference. There is no guarantee that the immutable references will have the same data after the mutable reference changes its value.</li>
<li>Users of an immutable reference don’t expect the value to suddenly change out from under them! However, multiple immutable references are allowed because no one who is just reading the data has the ability to affect anyone else’s reading of the data. Example below shows and error with mixing immutable and mutable references causing an error:</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// no problem</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r2</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// no problem</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r3</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// BIG PROBLEM</span>

    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"{}, {}, and {}"</span>, r1, r2, r3<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>But this code will work just fine because we're using the immutable references before we create the mutable one:</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// no problem</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r2</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// no problem</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"{} and {}"</span>, r1, r2<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #5B6268;">// variables r1 and r2 will not be used after this point</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">r3</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> s<span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// no problem</span>
<span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"{}"</span>, r3<span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd802ad" class="outline-4">
<h4 id="orgdd802ad"><span class="section-number-4">14.4.5.</span> Protection against Dangling Pointers</h4>
<div class="outline-text-4" id="text-14-4-5">
<ul class="org-ul">
<li>Example of a code that will cause an error because we're trying to create a dangling pointer without a lifecycle</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">reference_to_nothing</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">dangle</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">dangle</span><span style="color: #fff0f5;">()</span> -&gt; <span style="color: #bbc2cf;">&amp;</span><span style="color: #ECBE7B;">String</span> <span style="color: #fff0f5;">{</span> <span style="color: #5B6268;">// dangle returns a reference to a String</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// s is a new String</span>

    <span style="color: #bbc2cf;">&amp;</span>s <span style="color: #5B6268;">// we return a reference to the String, s</span>
<span style="color: #fff0f5;">}</span> <span style="color: #5B6268;">// Here, s goes out of scope, and is dropped. Its memory goes away.</span>
  <span style="color: #5B6268;">// Danger!</span>

</pre>
</div>
<ul class="org-ul">
<li>The quick and easy solution is to return the value directly (it is a pointer under the hood either way&#x2026;)</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">string</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">no_dangle</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">no_dangle</span><span style="color: #fff0f5;">()</span> -&gt; <span style="color: #ECBE7B;">String</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    s
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org96bd6bc" class="outline-2">
<h2 id="org96bd6bc"><span class="section-number-2">15.</span> Slice Type</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org8e50569" class="outline-3">
<h3 id="org8e50569"><span class="section-number-3">15.1.</span> Definition</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li>Slices let you reference a contiguous sequence of elements in a collection rather than the whole collection. A slice is a kind of reference, so it does not have ownership.</li>
<li>Internally a Slice contains the pointer to the start of the data and the length of the data</li>
</ul>
</div>
</div>
