notes/resources/rust/rust.org
** Caveats
   - The Slice of a ~String~ is a ~&str~
   - String literals are slices, so a ~let s = "Hello World"~ is actually a String slice, the type of ~s~ is ~&str~
   - It is preferred to use String slices as function parameters, because it will accept both ~&Strings~ (references) and ~&str~ (Slices) due to /deref coercions/, which will be explained later in *Implicit Deref Coercion in Methods and Functions*
   #+begin_src rust
     fn first_word(s: &str) -> &str { // using a &str instead of &String
         let bytes = s.as_bytes();

         for (i, &item) in bytes.iter().enumerate() {
             if item == b' ' {
                 return &s[0..i];
             }
         }

         &s[..]
     }

     fn main() {
         let my_string = String::from("hello world");

         // `first_word` works on slices of `String`s, whether partial or whole
         let word = first_word(&my_string[0..6]);
         let word = first_word(&my_string[..]);
         // `first_word` also works on references to `String`s, which are equivalent
         // to whole slices of `String`s
         let word = first_word(&my_string);

         let my_string_literal = "hello world";

         // `first_word` works on slices of string literals, whether partial or whole
         let word = first_word(&my_string_literal[0..6]);
         let word = first_word(&my_string_literal[..]);

         // Because string literals *are* string slices already,
         // this works too, without the slice syntax!
         let word = first_word(my_string_literal);
     }
   #+end_src
** Declaring a Slice uses Rust's Range syntax
   - Given some string ~let s = String:from("Hello");~
   - ~&s[starting_index..ending_index]~, ending index is exclusive, starting is inclusive
   - ~&s[..3]~ starting at 0 and ending at 2
   - ~&s[2..]~ starting at 2 and ending at the length of the underlying data
   - ~&s[..]~ the full length
   - For Arrays we can use ~&[i32]~
   #+begin_src rust
     let a = [1, 2, 3, 4, 5];

     let slice = &a[1..3];

     assert_eq!(slice, &[2, 3]);
   #+end_src
** Example on a String Slice
   #+begin_src rust
     let s = String::from("hello world");

     let hello = &s[0..5];
     let world = &s[6..11];
   #+end_src
** Example of a problem noticed by the compiler thanks to Slices usage
   #+begin_src rust
     fn main() {
         let mut s = String::from("hello world");

         let word = first_word(&s); // returns a Slice containing "hello", immutable borrow

         s.clear(); // error! mutable borrow

         // error due to ownership rules
         // immutable borrow can't occur due to the previous mutable borrow
         println!("the first word is: {}", word);
     }
   #+end_src
* Structs
