notes/resources/rust/rust.html
<div id="outline-container-org1c4cf62" class="outline-3">
<h3 id="org1c4cf62"><span class="section-number-3">15.2.</span> Caveats</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>The Slice of a <code>String</code> is a <code>&amp;str</code></li>
<li>String literals are slices, so a <code>let s = "Hello World"</code> is actually a String slice, the type of <code>s</code> is <code>&amp;str</code></li>
<li>It is preferred to use String slices as function parameters, because it will accept both <code>&amp;Strings</code> (references) and <code>&amp;str</code> (Slices) due to <i>deref coercions</i>, which will be explained later in <b>Implicit Deref Coercion in Methods and Functions</b></li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">first_word</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">s</span>: <span style="color: #bbc2cf;">&amp;</span><span style="color: #ECBE7B;">str</span><span style="color: #fff0f5;">)</span> -&gt; <span style="color: #bbc2cf;">&amp;</span><span style="color: #ECBE7B;">str</span> <span style="color: #fff0f5;">{</span> <span style="color: #5B6268;">// using a &amp;str instead of &amp;String</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">bytes</span> <span style="color: #bbc2cf;">=</span> s<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">as_bytes</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">for</span> <span style="color: #c678dd;">(</span><span style="color: #db5762;">i</span>, <span style="color: #bbc2cf;">&amp;</span>item<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">in</span> bytes<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">iter</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">enumerate</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-style: italic;">if</span> item <span style="color: #bbc2cf;">==</span> <span style="color: #98be65;">b' '</span> <span style="color: #98be65;">{</span>
            <span style="color: #51afef; font-style: italic;">return</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #00bfff;">[</span><span style="color: #a9a1e1;">0</span>..i<span style="color: #00bfff;">]</span><span style="color: #bbc2cf;">;</span>
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #c678dd;">[</span>..<span style="color: #c678dd;">]</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">my_string</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello world"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #5B6268;">// `first_word` works on slices of `String`s, whether partial or whole</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>my_string<span style="color: #98be65;">[</span><span style="color: #a9a1e1;">0</span>..<span style="color: #a9a1e1;">6</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>my_string<span style="color: #98be65;">[</span>..<span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #5B6268;">// `first_word` also works on references to `String`s, which are equivalent</span>
    <span style="color: #5B6268;">// to whole slices of `String`s</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>my_string<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">my_string_literal</span> <span style="color: #bbc2cf;">=</span> <span style="color: #98be65;">"hello world"</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #5B6268;">// `first_word` works on slices of string literals, whether partial or whole</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>my_string_literal<span style="color: #98be65;">[</span><span style="color: #a9a1e1;">0</span>..<span style="color: #a9a1e1;">6</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>my_string_literal<span style="color: #98be65;">[</span>..<span style="color: #98be65;">]</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #5B6268;">// Because string literals *are* string slices already,</span>
    <span style="color: #5B6268;">// this works too, without the slice syntax!</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span>my_string_literal<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org30493f8" class="outline-3">
<h3 id="org30493f8"><span class="section-number-3">15.3.</span> Declaring a Slice using Rust's Range syntax</h3>
<div class="outline-text-3" id="text-15-3">
<ul class="org-ul">
<li>Given some string <code>let s = String:from("Hello");</code></li>
<li><code>&amp;s[starting_index..ending_index]</code>, ending index is exclusive, starting is inclusive</li>
<li><code>&amp;s[..3]</code> starting at 0 and ending at 2</li>
<li><code>&amp;s[2..]</code> starting at 2 and ending at the length of the underlying data</li>
<li><code>&amp;s[..]</code> the full length</li>
<li>For Arrays we can use <code>&amp;[i32]</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">a</span> <span style="color: #bbc2cf;">=</span> <span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">1</span>, <span style="color: #a9a1e1;">2</span>, <span style="color: #a9a1e1;">3</span>, <span style="color: #a9a1e1;">4</span>, <span style="color: #a9a1e1;">5</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">slice</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>a<span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">1</span>..<span style="color: #a9a1e1;">3</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-weight: bold;">assert_eq!</span><span style="color: #fff0f5;">(</span>slice, &amp;<span style="color: #c678dd;">[</span><span style="color: #a9a1e1;">2</span>, <span style="color: #a9a1e1;">3</span><span style="color: #c678dd;">]</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc385f7e" class="outline-3">
<h3 id="orgc385f7e"><span class="section-number-3">15.4.</span> Example on a String Slice</h3>
<div class="outline-text-3" id="text-15-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"hello world"</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">hello</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">0</span>..<span style="color: #a9a1e1;">5</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">world</span> <span style="color: #bbc2cf;">=</span> <span style="color: #bbc2cf;">&amp;</span>s<span style="color: #fff0f5;">[</span><span style="color: #a9a1e1;">6</span>..<span style="color: #a9a1e1;">11</span><span style="color: #fff0f5;">]</span><span style="color: #bbc2cf;">;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8e7b5f9" class="outline-3">
<h3 id="org8e7b5f9"><span class="section-number-3">15.5.</span> Example of a problem noticed by the compiler thanks to Slices usage</h3>
<div class="outline-text-3" id="text-15-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">s</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"hello world"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">word</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">first_word</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span>s<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// returns a Slice containing "hello", immutable borrow</span>

    s<span style="color: #bbc2cf;">.</span><span style="color: #c678dd; font-weight: bold; font-style: italic;">clear</span><span style="color: #c678dd;">()</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// error! mutable borrow</span>

    <span style="color: #5B6268;">// error due to ownership rules</span>
    <span style="color: #5B6268;">// immutable borrow can't occur due to the previous mutable borrow</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"the first word is: {}"</span>, word<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
</div>
