notes/resources/rust/rust.org
** Syntax
   - All fields are ~private~ by default
   - Add ~pub~ to make any field public
   - Use the dot notation to access fields
*** Basic ~User~ struct
    #+begin_src rust
      struct User {
          pub active: bool,
          username: String,
          email: String,
          sign_in_count: u64,
      }
    #+end_src
    - In the User struct definition we used the owned String type rather than the &str string slice type. This is a deliberate choice because we want each instance of this struct to own all of its data and for that data to be valid for as long as the entire struct is valid. It’s also possible for structs to store references to data owned by something else, but to do so requires the use of lifetimes.
*** Changing any fields is not allowed, to change any you must declare the struct with ~mut~
    #+begin_src rust
      fn main() {
          let mut user1 = User { // using mut here
              email: String::from("someone@example.com"),
              username: String::from("someusername123"),
              active: true,
              sign_in_count: 1,
          };

          // because user1 is mutable, we are allowed to modify the email field
          user1.email = String::from("anotheremail@example.com");
      }

    #+end_src
*** Debugging with the ~Debug~ derived ~trait~
    - Debug with the ~println!~ macro
    #+begin_src rust
      #[derive(Debug)]  // note the derive Debug trait
      struct Rectangle {
          width: u32,
          height: u32,
      }

      fn main() {
          let rect1 = Rectangle {
              width: 30,
              height: 50,
          };

          println!("rect1 is {:?}", rect1); // using the :? syntax to debug print
          println!("rect1 is {:#?}", rect1); // using the :#? syntax to pretty-print
      }

    #+end_src
    - Alternatively use the ~dbg!~ macro, note that it returns ownership
    #+begin_src rust
      #[derive(Debug)]
      struct Rectangle {
          width: u32,
          height: u32,
      }

      fn main() {
          let scale = 2;
          let rect1 = Rectangle {
              width: dbg!(30 * scale), // returns ownership
              height: 50,
          };

          dbg!(&rect1);
      }

    #+end_src
