notes/resources/rust/rust.html
<div id="outline-container-orgb1868f1" class="outline-2">
<h2 id="orgb1868f1"><span class="section-number-2">16.</span> Structs</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgf368e41" class="outline-3">
<h3 id="orgf368e41"><span class="section-number-3">16.1.</span> Syntax</h3>
<div class="outline-text-3" id="text-16-1">
<ul class="org-ul">
<li>All fields are <code>private</code> by default</li>
<li>Add <code>pub</code> to make any field public</li>
<li>Use the dot notation to access fields</li>
</ul>
</div>
<div id="outline-container-orgb4422e5" class="outline-4">
<h4 id="orgb4422e5"><span class="section-number-4">16.1.1.</span> Basic <code>User</code> struct</h4>
<div class="outline-text-4" id="text-16-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">User</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">pub</span> <span style="color: #db5762; font-style: italic;">active</span>: <span style="color: #ECBE7B;">bool</span>,
    <span style="color: #db5762; font-style: italic;">username</span>: <span style="color: #ECBE7B;">String</span>,
    <span style="color: #db5762; font-style: italic;">email</span>: <span style="color: #ECBE7B;">String</span>,
    <span style="color: #db5762; font-style: italic;">sign_in_count</span>: <span style="color: #ECBE7B;">u64</span>,
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>In the User struct definition we used the owned String type rather than the &amp;str string slice type. This is a deliberate choice because we want each instance of this struct to own all of its data and for that data to be valid for as long as the entire struct is valid. It’s also possible for structs to store references to data owned by something else, but to do so requires the use of lifetimes.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbcc8316" class="outline-4">
<h4 id="orgbcc8316"><span class="section-number-4">16.1.2.</span> Changing any fields is not allowed, to change any you must declare the struct with <code>mut</code></h4>
<div class="outline-text-4" id="text-16-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">user1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">User</span> <span style="color: #c678dd;">{</span> <span style="color: #5B6268;">// using mut here</span>
        <span style="color: #a9a1e1; font-style: italic;">email</span>: <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"someone@example.com"</span><span style="color: #98be65;">)</span>,
        <span style="color: #a9a1e1; font-style: italic;">username</span>: <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"someusername123"</span><span style="color: #98be65;">)</span>,
        <span style="color: #a9a1e1; font-style: italic;">active</span>: <span style="color: #a9a1e1;">true</span>,
        <span style="color: #a9a1e1; font-style: italic;">sign_in_count</span>: <span style="color: #a9a1e1;">1</span>,
    <span style="color: #c678dd;">}</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #5B6268;">// because user1 is mutable, we are allowed to modify the email field</span>
    <span style="color: #db5762;">user1</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">email</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"anotheremail@example.com"</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org0e3d9f3" class="outline-4">
<h4 id="org0e3d9f3"><span class="section-number-4">16.1.3.</span> Debugging with the <code>Debug</code> derived <code>trait</code></h4>
<div class="outline-text-4" id="text-16-1-3">
<ul class="org-ul">
<li>Debug with the <code>println!</code> macro</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-weight: bold;">#</span><span style="color: #fff0f5; font-weight: bold;">[</span><span style="color: #51afef; font-weight: bold;">derive</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #51afef; font-weight: bold;">Debug</span><span style="color: #c678dd; font-weight: bold;">)</span><span style="color: #fff0f5; font-weight: bold;">]</span>  <span style="color: #5B6268;">// note the derive Debug trait</span>
<span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #db5762; font-style: italic;">width</span>: <span style="color: #ECBE7B;">u32</span>,
    <span style="color: #db5762; font-style: italic;">height</span>: <span style="color: #ECBE7B;">u32</span>,
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">rect1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #c678dd;">{</span>
        <span style="color: #a9a1e1; font-style: italic;">width</span>: <span style="color: #a9a1e1;">30</span>,
        <span style="color: #a9a1e1; font-style: italic;">height</span>: <span style="color: #a9a1e1;">50</span>,
    <span style="color: #c678dd;">}</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"rect1 is {:?}"</span>, rect1<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// using the :? syntax to debug print</span>
    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"rect1 is {:#?}"</span>, rect1<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span> <span style="color: #5B6268;">// using the :#? syntax to pretty-print</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
<ul class="org-ul">
<li>Alternatively use the <code>dbg!</code> macro, note that it returns ownership</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-weight: bold;">#</span><span style="color: #fff0f5; font-weight: bold;">[</span><span style="color: #51afef; font-weight: bold;">derive</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #51afef; font-weight: bold;">Debug</span><span style="color: #c678dd; font-weight: bold;">)</span><span style="color: #fff0f5; font-weight: bold;">]</span>
<span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #db5762; font-style: italic;">width</span>: <span style="color: #ECBE7B;">u32</span>,
    <span style="color: #db5762; font-style: italic;">height</span>: <span style="color: #ECBE7B;">u32</span>,
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">scale</span> <span style="color: #bbc2cf;">=</span> <span style="color: #a9a1e1;">2</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">rect1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #c678dd;">{</span>
        <span style="color: #a9a1e1; font-style: italic;">width</span>: <span style="color: #51afef; font-weight: bold;">dbg!</span><span style="color: #98be65;">(</span><span style="color: #a9a1e1;">30</span> * scale<span style="color: #98be65;">)</span>, <span style="color: #5B6268;">// returns ownership</span>
        <span style="color: #a9a1e1; font-style: italic;">height</span>: <span style="color: #a9a1e1;">50</span>,
    <span style="color: #c678dd;">}</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-weight: bold;">dbg!</span><span style="color: #c678dd;">(</span>&amp;rect1<span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
</div>
</div>
</div>
