notes/resources/rust/rust.org
** Builders
   #+begin_src rust
     fn build_user(email: String, username: String) -> User {
         User {
             email: email,
             username: username,
             active: true,
             sign_in_count: 1,
         }
     }

     fn main() {
         let user1 = build_user(
             String::from("someone@example.com"),
             String::from("someusername123"),
         );
     }
   #+end_src
   - Or use the *Field Init Shorthand*
   #+begin_src rust
     fn build_user(email: String, username: String) -> User {
         User {
             email,  // using shorthand
             username, // using shorthand
             active: true,
             sign_in_count: 1,
         }
     }
   #+end_src
** Instantiate an instance from another instance using a shorthand
   - Please note that the fields that we want to overwrite *must be* above the shorthand notation
   #+begin_src rust
     fn main() {
         let user1 = User {
             email: String::from("someone@example.com"),
             username: String::from("someusername123"),
             active: true,
             sign_in_count: 1,
         };

         let user2 = User {
             email: String::from("another@example.com"), // overwriting email
             ..user1 // using the other fields from user1
         };
     }
   #+end_src
   - Note that the struct update syntax uses ~=~ like an assignment; this is because it moves the data. In this example, we can no longer use ~user1~ after creating ~user2~ because the String in the ~username~ field of ~user1~ was moved into ~user2~. If we had given ~user2~ new String values for both ~email~ and ~username~, and thus only used the active and sign_in_count values from ~user1~, then ~user1~ would still be valid after creating ~user2~. The types of ~active~ and ~sign_in_count~ are types that implement the ~Copy Trait~.
** Tuple Structs without names fields
   #+begin_src rust
     struct Color(i32, i32, i32);
     struct Point(i32, i32, i32);

     fn main() {
         let black = Color(0, 0, 0);
         let origin = Point(0, 0, 0);
     }

   #+end_src
** Unit-like Struct without fields
   - Unit-like structs can be useful when you need to implement a ~trait~ on some type but don’t have any data that you want to store in the type itself
   #+begin_src rust
     struct AlwaysEqual;

     fn main() {
         let subject = AlwaysEqual;
     }

   #+end_src
** Method Syntax
