notes/resources/rust/rust.html
<div id="outline-container-org11dbf89" class="outline-3">
<h3 id="org11dbf89"><span class="section-number-3">16.2.</span> Builders</h3>
<div class="outline-text-3" id="text-16-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">build_user</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">email</span>: <span style="color: #ECBE7B;">String</span>, <span style="color: #db5762;">username</span>: <span style="color: #ECBE7B;">String</span><span style="color: #fff0f5;">)</span> -&gt; <span style="color: #ECBE7B;">User</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #ECBE7B;">User</span> <span style="color: #c678dd;">{</span>
        <span style="color: #a9a1e1; font-style: italic;">email</span>: email,
        <span style="color: #a9a1e1; font-style: italic;">username</span>: username,
        <span style="color: #a9a1e1; font-style: italic;">active</span>: <span style="color: #a9a1e1;">true</span>,
        <span style="color: #a9a1e1; font-style: italic;">sign_in_count</span>: <span style="color: #a9a1e1;">1</span>,
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">user1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #c678dd;">build_user</span><span style="color: #c678dd;">(</span>
        <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"someone@example.com"</span><span style="color: #98be65;">)</span>,
        <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"someusername123"</span><span style="color: #98be65;">)</span>,
    <span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Or use the <b>Field Init Shorthand</b></li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">build_user</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">email</span>: <span style="color: #ECBE7B;">String</span>, <span style="color: #db5762;">username</span>: <span style="color: #ECBE7B;">String</span><span style="color: #fff0f5;">)</span> -&gt; <span style="color: #ECBE7B;">User</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #ECBE7B;">User</span> <span style="color: #c678dd;">{</span>
        email,  <span style="color: #5B6268;">// using shorthand</span>
        username, <span style="color: #5B6268;">// using shorthand</span>
        <span style="color: #a9a1e1; font-style: italic;">active</span>: <span style="color: #a9a1e1;">true</span>,
        <span style="color: #a9a1e1; font-style: italic;">sign_in_count</span>: <span style="color: #a9a1e1;">1</span>,
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge552caf" class="outline-3">
<h3 id="orge552caf"><span class="section-number-3">16.3.</span> Instantiate an instance from another instance using a shorthand</h3>
<div class="outline-text-3" id="text-16-3">
<ul class="org-ul">
<li>Please note that the fields that we want to overwrite <b>must be</b> above the shorthand notation</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">user1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">User</span> <span style="color: #c678dd;">{</span>
        <span style="color: #a9a1e1; font-style: italic;">email</span>: <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"someone@example.com"</span><span style="color: #98be65;">)</span>,
        <span style="color: #a9a1e1; font-style: italic;">username</span>: <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"someusername123"</span><span style="color: #98be65;">)</span>,
        <span style="color: #a9a1e1; font-style: italic;">active</span>: <span style="color: #a9a1e1;">true</span>,
        <span style="color: #a9a1e1; font-style: italic;">sign_in_count</span>: <span style="color: #a9a1e1;">1</span>,
    <span style="color: #c678dd;">}</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">user2</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">User</span> <span style="color: #c678dd;">{</span>
        <span style="color: #a9a1e1; font-style: italic;">email</span>: <span style="color: #ECBE7B;">String</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">from</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"another@example.com"</span><span style="color: #98be65;">)</span>, <span style="color: #5B6268;">// overwriting email</span>
        ..user1 <span style="color: #5B6268;">// using the other fields from user1</span>
    <span style="color: #c678dd;">}</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Note that the struct update syntax uses <code>=</code> like an assignment; this is because it moves the data. In this example, we can no longer use <code>user1</code> after creating <code>user2</code> because the String in the <code>username</code> field of <code>user1</code> was moved into <code>user2</code>. If we had given <code>user2</code> new String values for both <code>email</code> and <code>username</code>, and thus only used the active and <code>sign_in_count</code> values from <code>user1</code>, then <code>user1</code> would still be valid after creating <code>user2</code>. The types of <code>active</code> and <code>sign_in_count</code> are types that implement the <code>Copy Trait</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgae0b8f0" class="outline-3">
<h3 id="orgae0b8f0"><span class="section-number-3">16.4.</span> Tuple Structs without named fields</h3>
<div class="outline-text-3" id="text-16-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">Color</span><span style="color: #fff0f5;">(</span><span style="color: #ECBE7B;">i32</span>, <span style="color: #ECBE7B;">i32</span>, <span style="color: #ECBE7B;">i32</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">Point</span><span style="color: #fff0f5;">(</span><span style="color: #ECBE7B;">i32</span>, <span style="color: #ECBE7B;">i32</span>, <span style="color: #ECBE7B;">i32</span><span style="color: #fff0f5;">)</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">black</span> <span style="color: #bbc2cf;">=</span> <span style="color: #51afef;">Color</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">0</span>, <span style="color: #a9a1e1;">0</span>, <span style="color: #a9a1e1;">0</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">origin</span> <span style="color: #bbc2cf;">=</span> <span style="color: #51afef;">Point</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">0</span>, <span style="color: #a9a1e1;">0</span>, <span style="color: #a9a1e1;">0</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org4859de6" class="outline-3">
<h3 id="org4859de6"><span class="section-number-3">16.5.</span> Unit-like Struct without fields</h3>
<div class="outline-text-3" id="text-16-5">
<ul class="org-ul">
<li>Unit-like structs can be useful when you need to implement a <code>trait</code> on some type but don’t have any data that you want to store in the type itself</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">AlwaysEqual</span><span style="color: #bbc2cf;">;</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">subject</span> <span style="color: #bbc2cf;">=</span> <span style="color: #51afef;">AlwaysEqual</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
</div>
</div>
