notes/resources/rust/rust.org
*** Basic Example
    - Use the ~impl~ block to declare any methods of a ~struct~
    - The ~&self~ essentially borrows the ~Self~ instance and is a shorthand of ~self: &self~
    - Use ~&mut self~ to create a method that mutates the instance
    - Having a method that takes ownership of the instance by using just ~self~ as the first parameter is rare; this technique is usually used when the method transforms ~self~ into something else and you want to prevent the caller from using the original instance after the transformation (you'd take the ownership and give back the ownership).
    #+begin_src rust
      struct Rectangle {
          width: u32,
          height: u32,
      }

      impl Rectangle {
          // implementing the area method on Rectangle struct
          fn area(&self) -> u32 {
              self.width * self.height
          }

          // implementing a mutating method, needs &mut self
          fn expand(&mut self, factor: u32) {
              self.width *= factor;
              self.height *= factor;
          }

          // more parameters, here another Rectangle as other
          fn can_hold(&self, other: &Rectangle) -> bool {
              self.width > other.width && self.height > other.height
          }
      }

      fn main() {
          let mut rect1 = Rectangle {
              width: 30,
              height: 50,
          };

          println!(
              "The area of the rectangle is {} square pixels.",
              rect1.area()
          );
      }
    #+end_src
*** Example of a constructor/builder
    - Please note that we don't use ~&self~ here
    #+begin_src rust
      struct Rectangle {
          width: u32,
          height: u32,
      }

      impl Rectangle {
          fn square(size: u32) -> Rectangle {
              Rectangle {
                  width: size,
                  height: size,
              }
          }
      }

      fn main() {
          let sq = Rectangle::square(3);
      }

    #+end_src

* Delete heading at the end
  #+BEGIN_EXPORT html
  <script src="../../assets/jquery-3.3.1.min.js"></script>
  <script src="../../assets/notes.js"></script>
  #+END_EXPORT
