notes/resources/rust/rust.html
<div id="outline-container-orgf3b4d6d" class="outline-3">
<h3 id="orgf3b4d6d"><span class="section-number-3">16.6.</span> Method Syntax</h3>
<div class="outline-text-3" id="text-16-6">
</div>
<div id="outline-container-org24a142f" class="outline-4">
<h4 id="org24a142f"><span class="section-number-4">16.6.1.</span> Basic Example</h4>
<div class="outline-text-4" id="text-16-6-1">
<ul class="org-ul">
<li>Use the <code>impl</code> block to declare any methods of a <code>struct</code></li>
<li>The <code>&amp;self</code> essentially borrows the <code>Self</code> instance and is a shorthand of <code>self: &amp;self</code></li>
<li>Use <code>&amp;mut self</code> to create a method that mutates the instance</li>
<li>Having a method that takes ownership of the instance by using just <code>self</code> as the first parameter is rare; this technique is usually used when the method transforms <code>self</code> into something else and you want to prevent the caller from using the original instance after the transformation (you'd take the ownership and give back the ownership).</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #db5762; font-style: italic;">width</span>: <span style="color: #ECBE7B;">u32</span>,
    <span style="color: #db5762; font-style: italic;">height</span>: <span style="color: #ECBE7B;">u32</span>,
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">impl</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">// implementing the area method on Rectangle struct</span>
    <span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">area</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">self</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">u32</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-style: italic;">self</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">width</span> <span style="color: #bbc2cf;">*</span> <span style="color: #51afef; font-style: italic;">self</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">height</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #5B6268;">// implementing a mutating method, needs &amp;mut self</span>
    <span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">expand</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #51afef; font-style: italic;">self</span>, <span style="color: #db5762;">factor</span>: <span style="color: #ECBE7B;">u32</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-style: italic;">self</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">width</span> *= factor<span style="color: #bbc2cf;">;</span>
        <span style="color: #51afef; font-style: italic;">self</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">height</span> *= factor<span style="color: #bbc2cf;">;</span>
    <span style="color: #c678dd;">}</span>

    <span style="color: #5B6268;">// more parameters, here another Rectangle as other</span>
    <span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">can_hold</span><span style="color: #c678dd;">(</span><span style="color: #bbc2cf;">&amp;</span><span style="color: #51afef; font-style: italic;">self</span>, <span style="color: #db5762;">other</span>: <span style="color: #bbc2cf;">&amp;</span><span style="color: #ECBE7B;">Rectangle</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-style: italic;">self</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">width</span> <span style="color: #bbc2cf;">&gt;</span> other<span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">width</span> <span style="color: #bbc2cf;">&amp;&amp;</span> <span style="color: #51afef; font-style: italic;">self</span><span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">height</span> <span style="color: #bbc2cf;">&gt;</span> other<span style="color: #bbc2cf;">.</span><span style="color: #a9a1e1; font-style: italic;">height</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #51afef; font-style: italic;">mut</span> <span style="color: #db5762;">rect1</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #c678dd;">{</span>
        <span style="color: #a9a1e1; font-style: italic;">width</span>: <span style="color: #a9a1e1;">30</span>,
        <span style="color: #a9a1e1; font-style: italic;">height</span>: <span style="color: #a9a1e1;">50</span>,
    <span style="color: #c678dd;">}</span><span style="color: #bbc2cf;">;</span>

    <span style="color: #51afef; font-weight: bold;">println!</span><span style="color: #c678dd;">(</span>
        <span style="color: #98be65;">"The area of the rectangle is {} square pixels."</span>,
        rect1.area<span style="color: #98be65;">()</span>
    <span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac4763e" class="outline-4">
<h4 id="orgac4763e"><span class="section-number-4">16.6.2.</span> Example of a constructor/builder</h4>
<div class="outline-text-4" id="text-16-6-2">
<ul class="org-ul">
<li>Please note that we don't use <code>&amp;self</code> here</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef; font-style: italic;">struct</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #db5762; font-style: italic;">width</span>: <span style="color: #ECBE7B;">u32</span>,
    <span style="color: #db5762; font-style: italic;">height</span>: <span style="color: #ECBE7B;">u32</span>,
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">impl</span> <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">square</span><span style="color: #c678dd;">(</span><span style="color: #db5762;">size</span>: <span style="color: #ECBE7B;">u32</span><span style="color: #c678dd;">)</span> -&gt; <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #c678dd;">{</span>
        <span style="color: #ECBE7B;">Rectangle</span> <span style="color: #98be65;">{</span>
            <span style="color: #a9a1e1; font-style: italic;">width</span>: size,
            <span style="color: #a9a1e1; font-style: italic;">height</span>: size,
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">sq</span> <span style="color: #bbc2cf;">=</span> <span style="color: #ECBE7B;">Rectangle</span><span style="color: #bbc2cf;">::</span><span style="color: #c678dd;">square</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">3</span><span style="color: #c678dd;">)</span><span style="color: #bbc2cf;">;</span>
<span style="color: #fff0f5;">}</span>

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbeba9b9" class="outline-2">
<h2 id="orgbeba9b9"><span class="section-number-2">17.</span> Delete heading at the end</h2>
<div class="outline-text-2" id="text-17">
<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-10-28 Thu 20:00</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2022-11-29 Tue 18:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
